##  logo = """           
##   ,adPPYba, ,adPPYYba,  ,adPPYba, ,adPPYba, ,adPPYYba, 8b,dPPYba,  
##  a8"     "" ""     `Y8 a8P_____88 I8[    "" ""     `Y8 88P'   "Y8  
##  8b         ,adPPPPP88 8PP"""""""        `"Y8ba,  ,adPPPPP88 88          
##  "8a,   ,aa 88,    ,88 "8b,   ,aa aa    ]8I 88,    ,88 88          
##   `"Ybbd8"' `"8bbdP"Y8  `"Ybbd8"' `"YbbdP"' `"8bbdP"Y8 88   
##                                                                
##                            88                  🤫               
##                            88                                 
##   ,adPPYba, 88 8b,dPPYba,  88,dPPYba,   ,adPPYba, 8b,dPPYba,  
##  a8"     "" 88 88P'    "8a 88P'    "8a a8P_____88 88P'   "Y8  
##  8b         88 88       d8 88       88 8PP"""""""       88          
##  "8a,   ,aa 88 88b,   ,a8" 88       88 "8b,   ,aa 88          
##   `"Ybbd8"' 88 88`YbbdP"'  88       88  `"Ybbd8"' 88          
##                88                                             
##                88           🤐
##  """

logo = """
⢀⣶⣿⣷⣦⣙⠶⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⢹⣿⣿⣿⣿⣷⣤⣉⠛⣡⣅⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠈⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⢠⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠉⠻⣿⣿⣿⣿⣿⣿⣿⣷⡌⠻⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠉⠛⠛⢿⣿⣿⣿⣿⠇⠈⢷⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢿⣿⣿⣷⣖⣤⣾⣷⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠻⣿⣿⣿⣿⣿⣿⣿⣦⡀⢤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣠⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢿⣿⣿⣿⣿⣿⣿⣿⣌⠹⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⠚⠉⠈⠉⠉⠻⢶⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⣿⣿⣿⣿⣿⣿⣿⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⣁⣤⣾⡇⢻⡶⢦⡬⢿⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⠿⠛⢡⣷⣾⡄⠀⠀⠈⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⣿⣿⣿⣿⣟⣻⣿⣗⠀⠈⠳⠀⠀⠀⠀⠀⠀⠀⠀⠀⢘⣿⡟⠒⣼⡿⠟⠃⠀⠀⣼⡽⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⣿⣿⣿⣿⣿⣿⣴⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣿⣿⣷⣜⣉⣁⣀⣠⣄⣹⢥⠞⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢿⣿⣿⣿⣿⣿⣿⣿⣦⡀⢦⡀⠀⠀⠀⠀⠀⠀⠀⠈⢹⣿⣿⣿⣿⣿⣏⣻⣟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠂⠀⠀⠀⠀⠀⠀⠀⠀⢹⣿⣿⣿⣿⣿⣿⣿⣷⣾⡗⣆⠀⢀⠀⠀⠀⠀⠀⣨⡿⠟⣍⠻⡍⠉⠁⠙⣦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠧⠄⠀⠠⠄⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⢻⡄⠈⠁⠸⣤⣤⠾⠁⠀⠐⠹⣦⠤⠄⠒⠉⠈⠳⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢳⡄⠹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣼⣧⢰⣷⢤⣽⣿⣿⣷⣦⣄⢀⣠⡴⠶⣤⣤⡤⢝⠺⠗⠒⠦⠤⢤⣀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⣆⠈⠻⣿⣿⣿⣿⣿⣿⣿⣿⢯⣿⡃⠀⠈⠛⠁⠙⣿⣿⣿⡹⠖⠀⠀⠀⠧⢤⣀⠀⠀⠀⠀⠀⠀⠉⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠆⠀⠀⠹⣿⣿⣿⣿⣿⡿⠟⢹⡅⠀⠀⠀⠀⠀⠈⢿⢿⣿⣦⡀⠀⠀⠀⠀⠈⢙⠿⠦⣄⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠿⣿⣿⣿⡀⠀⣸⡷⠒⠋⠀⠀⠀⠀⠈⠉⠙⢿⣷⣦⣀⠀⠀⠀⣞⣷⠀⠈⣶⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⣿⡗⠒⢻⡇⠀⠀⠀⢀⣤⣤⣤⡅⠒⠲⣝⠿⠛⠛⠓⠦⣯⣝⠃⠀⢸⡗⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠰⢹⣿⣄⣠⣴⣶⣿⣿⡿⣿⣿⠗⠃⠀⠀⠈⡇⠀⠀⠀⠀⠀⠈⠁⠳⢾⡇⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣿⣿⣿⣿⣿⣿⣿⡗⣉⣴⣷⣤⡀⠤⠤⣧⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡿⠟⠋⠉⠉⠉⠈⣿⣿⣷⣿⣿⣷⣄⣰⣿⣷⣶⡦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⢯⡾⠀⠀⠀⠀⠀⢠⠉⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⢟⡖⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣶⣦⣤⣤⣀⣀⣀⡀
"""
# print logo
print(logo)

# list of alphabet
elements = ['a','b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z','a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z']

#running conditions
run_again = True

while run_again:
    # all inputs
    direction = input("Type 'encode' to encrypt🔒, type 'decode' to decrypt🔓:\n").lower()
    text = input("Type your message:\n")
    shift = int(input("Type the employee ID:\n"))
    shift %= 26

    # short code
    #define new function
    def caesar(plain_text=text, shift_amount=shift):
        caesar_cipher = ""
        for letter in plain_text:
            if letter in elements:
                pos = elements.index(letter)
                if direction == "encode":
                    new_pos = pos + shift_amount
                    caesar_cipher += elements[new_pos]
                elif direction == "decode":
                    new_pos = pos - shift_amount
                    caesar_cipher += elements[new_pos]
            else:
                caesar_cipher += letter
        print(caesar_cipher)
    caesar()

    result = input("did you want to run it again 'yes' or 'no'!\n ").lower()
    if result == "no":
        run_again = False
        print("good bye 😊")
        










            #   first time long code
# def encrypt(plain_text, shift_amount):

#     caesar_cipher = ""
#     for letter in plain_text:
#         pos = alphabet.index(letter)
#         new_pos = pos + shift_amount
#         caesar_cipher += alphabet[new_pos]
#     print(caesar_cipher)



# def decrypt(cipher_text, shift_amount):
#     caesar_cipher = ""
#     for letter in cipher_text:
#         pos = alphabet.index(letter)
#         new_pos = pos - (shift_amount)
#         caesar_cipher += alphabet[new_pos]
#     print(caesar_cipher)

# if direction == "encode":
#     encrypt(plain_text=text, shift_amount=shift)
# elif direction == "decode":
#     decrypt(cipher_text=text, shift_amount=shift)
